---
kind: property
id: P:Autodesk.Revit.DB.CurveArray.Item(System.Int32)
source: html/a384e5d7-7612-e7b0-7174-f2d8dc8ade16.htm
---
# Autodesk.Revit.DB.CurveArray.Item Property

Gets or sets a curve at a specified index within the array.

## Syntax (C#)
```csharp
public virtual Curve this[
	int index
] { get; set; }
```

## Parameters
- **index** (`System.Int32`) - The index of the curve to be set or retrieved.

## Returns
Returns the curve at the specified index.